#+title: Day7

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_type_struct2.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_type_struct2.c -o mpi_type_struct2.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_type_struct2.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_type_struct2.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_type_struct2.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 has struct: {arr = [1, 2, 3], b = 3.14, c = A}
  Process 1 received struct: {arr = [1, 2, 0], b = 3.14, c = A}

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

This example demonstrates how to use `MPI_Type_create_struct` to communicate complex data structures in MPI, specifically how to send parts of an array along with other fields.

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_pack_unpack.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_pack_unpack.c -o mpi_pack_unpack.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_pack_unpack.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_pack_unpack.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_pack_unpack.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 sent packed data
  Process 1 received unpacked data: {a = 42, b = 3.14, c = A}
  3493465760 3493465760 3493465760
  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

This example demonstrates how to use `MPI_Pack` and `MPI_Unpack` to communicate complex data structures in MPI.

*** Example
Let's calculate the buffer size for packing an integer, a double, and a char.

#+BEGIN_SRC C :tangle mpi_pack_size.c
#include <mpi.h>
#include <stdio.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int size_int, size_double, size_char, total_size;
    MPI_Pack_size(1, MPI_INT, MPI_COMM_WORLD, &size_int);
    MPI_Pack_size(1, MPI_DOUBLE, MPI_COMM_WORLD, &size_double);
    MPI_Pack_size(1, MPI_CHAR, MPI_COMM_WORLD, &size_char);

    total_size = size_int + size_double + size_char;
    printf("Buffer size required for packing: %d bytes\n", total_size);

    MPI_Finalize();
    return 0;
}
#+END_SRC

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_pack_size.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_pack_size.c -o mpi_pack_size.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_pack_size.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_pack_size.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_pack_size.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Buffer size required for packing: 13 bytes
  Buffer size required for packing: 13 bytes

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_probe_get_count.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_probe_get_count.c -o mpi_probe_get_count.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_probe_get_count.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_probe_get_count.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_probe_get_count.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 sent data to process 1
  Process 1 received 5 integers:
  1 2 3 4 5

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

* Task
#+BEGIN_SRC C :tangle mpi_any_src_and_tag.c
#include <mpi.h>
#include <stdio.h>
#include <stdlib.h>
#include <stddef.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if (size < 2) {
        fprintf(stderr, "World size must be greater than 1 for this example\n");
        MPI_Abort(MPI_COMM_WORLD, 1);
    }

    if (rank != 0) {
        MPI_Send(&rank, 1, MPI_INT, 0, 0, MPI_COMM_WORLD);
    } else {
        int data = 0;
        MPI_Recv(&data, 1, MPI_INT, MPI_ANY_SOURCE, MPI_ANY_TAG, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
        printf("I have received message from process %d\n", data);
    }

    MPI_Finalize();
    return 0;
}
#+END_SRC

#+begin_src bash :results output :exports both
bash compile.sh mpi_any_src_and_tag.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc mpi_any_src_and_tag.c -o mpi_any_src_and_tag.out
: ------------------------------------------------------------------
: Compilation successful. Check at mpi_any_src_and_tag.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./mpi_any_src_and_tag.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./mpi_any_src_and_tag.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

I have received message from process 5

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

* Task v2
#+BEGIN_SRC C :tangle mpi_any_src_and_tag2.c
#include <mpi.h>
#include <stdio.h>
#include <stdlib.h>
#include <stddef.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if (size < 2) {
        fprintf(stderr, "World size must be greater than 1 for this example\n");
        MPI_Abort(MPI_COMM_WORLD, 1);
    }

    if (rank != 0) {
        int data = 100;
        MPI_Send(&data, 1, MPI_INT, 0, 0, MPI_COMM_WORLD);
    } else {
        MPI_Status status;
        int data = 0;
        MPI_Recv(&data, 1, MPI_INT, MPI_ANY_SOURCE, MPI_ANY_TAG, MPI_COMM_WORLD, &status);
        printf("I have received message from process %d\n", status.MPI_SOURCE);
    }

    MPI_Finalize();
    return 0;
}
#+END_SRC

#+begin_src bash :results output :exports both
bash compile.sh mpi_any_src_and_tag.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc mpi_any_src_and_tag.c -o mpi_any_src_and_tag.out
: ------------------------------------------------------------------
: Compilation successful. Check at mpi_any_src_and_tag.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./mpi_any_src_and_tag.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./mpi_any_src_and_tag.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

I have received message from process 5

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

